title: Suspicious PowerShell Download
id: 1111-2222-3333-4444
status: test
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\powershell.exe'
        CommandLine|contains:
            - '-enc'
            - 'SQBFAFg' # Parte base64 común de descarga
    condition: selection
